ci4/app/Controllers/CustomerController.php

SELECT *
FROM `mst_customer`
---
    public function ViewData()
    {
        $dataCustCat = new \App\Models\CustCatModel();
        $CustCat = $dataCustCat->findAll();

        $dataCustomer = new \App\Models\CustomerModel();
        $Customer = $dataCustomer->findAll();